{
        "0": {
                "img": "/media/how-to-make-a-debating-motion.jpg",
                "title": "How to make a Debating Motion?",
                "description": "Today we will be talking about motions. I would be using debating terms like “motion” here and there, but I will  always include a link of that word to my debating terminology glossary. Let’s get started. So, what is a motion? Basically, it is the topic which the debate is about. There are two sides which would be arguing this (although there could be four teams, sometimes). Without further ado, point number one: 1. Balance is Key The first thing I would suggest you consider is whether there is a balanced argument to both sides. Can both sides make a case, can either side win? This is where the real skill of creating a motion comes into play. You shouldn’t make a motion where there is a defined answer to, for example, a motion like “THBT crime should not be punished”. These are questions which have a recognised answer to.",
                "link": "/post/2024/05/how-to-make-a-debating-motion.html",
                "button": "Read More"
        },
        "1": {
                "img": "/media/under-a-star-called-sun.png",
                "title": "why it matters to remember",
                "description": "cecil richard’s under a star called sun is a  reader-led short story about a narrator where “the trajectory  of [his] ship is unchanging.” he (i like to see myself on the ship; you may too) recalls that  coffee “never tastes as good as the ones you get from the cafes back home,” as a quiet matter-of-fact. now, it’s very unlikely that the coffee could be so physically or chemically different than the ones here on earth. rather, the difference would make you laugh. i propose it is akin to how coffee your loved one makes is always better than starbucks (no offence). it is not the chemistry of your mug that matters, but rather the chemistry of your mind. but what is so important about this? he, remembers what earth felt like and what a world full of love feels like. even in his solitary moments with just coffee, his mind takes the trip back to home. it takes a very lonely astronaut to wish they were back home. we usually climb the ladder to the stars when we are alone on the soil.",
                "link": "/post/2024/08/why-it-matters-to-remember.html",
                "button": "Read More"
        },
        "2": {
                "img": "/media/bgs-image.png",
                "title": "Laboratory life: my work experience week at BGS",
                "description": "My week began with a welcome tour of the research facilities at BGS and, more specifically, the geochemistry  laboratories. The team provided an introduction to the field of mass spectrometry and the use of isotopes in archaeological research. The sample preparation, which happens under very precise, controlled conditions to exclude contamination, involves a huge amount work prior to analysis. It wasn’t long before I was gaining hands-on experience working with carbon isotopes from organic and inorganic materials, preparing samples and then analysing them on mass spectrometers. For me, one of the highlights was learning how to handle samples down to 40 micrograms in weight — which I can confirm is difficult to see with the naked eye!",
                "link": "https://www.bgs.ac.uk/news/laboratory-life-my-work-experience-week-at-bgs/",
                "button": "BGS Blogs <i style='font-size:small' class='fa'>&#xf08e;</i>"
        },
        "3": {
                "img": "/media/fifty-shades-of-gender.webp",
                "title": "50 Shades of Gender: Gender Complexity and a Post-Gender Society",
                "description": "For much of recorded history, gender and sex were used interchangeably: male meant XY chromosomes and masculinity, female meant XX chromosomes and femininity. However, modern gender has evolved into a broader and more nuanced spectrum—some sources listing dozens—if not hundreds—of uniquely defined identities. This essay examines the nature of gender, and argues for abolishing gender as a descriptive identifying term. Historically, and even now in some societies, gender was a binary. I, myself, have seen and experienced what it feels like to be a part of such a society. Modern definition of “gender” has evolved away from “sex” into a social construct. However, the restriction of sex-gender equivalence is also a social construct. So, would it not be fair to argue that social categorisation is inherently restrictive? Let’s explore this. Suppose you have a gradient of colours. Perhaps it looks like the one below:",
                "link": "/post/2025/04/fifty-shades-of-gender.html",
                "button": "Read More"
        },
        "4": {
                "img": "/media/authorial-god.jpg",
                "title": "The Authorial God Hypothesis",
                "description": "God—in many belief systems and prominently, the Abrahamic tradition—is an omnipotent, omniscient, omnipresent, omnibenevolent, and perfect being. These faiths and beliefs also credit God for creating the universe and its inhabitants: us. Equally so, some faiths believe in multiple and more human-like Gods: the Ancient Greeks, Ancient Egyptians, and Hinduism are examples. There are even some beliefs that believe in a false God (Gnosticism) or one capable of malice (Dystheism). This is a simplified non-exhaustive overview of the diversity among those who do believe in a God/s. Within this range lies a God I would refer to as Authorial. This essay proposes a theological cosmology compatible with natural laws and divine causality, to reframe our relationship with our Creator and our understanding of will and purpose.",
                "link": "/post/2025/08/authorial-god-hypothesis.html",
                "button": "Read More"
        },
        "5": {
                "img": "/media/buddhism-in-sri-lanka.jpeg",
                "title": "Implications of Buddhism on Political Systems in Sri Lanka",
                "description": "Buddhism, the state religion of Sri Lanka, has remained entangled in all lives and institutions of Sri Lanka. Historically, royal patronage and religious loyalty have elevated Buddhism to a state of authority. This report examines existing literature, including public opinion, to explore implications of Buddhism on political thought, governance, and authority figures in Sri Lanka. Main findings characterise Buddhist clergy and institutions to be embedded in the Sri Lankan political landscape. They act as informal political advisory bodies, influencing state governance often overruling electoral mandates. Furthermore, Buddhist Nationalist rhetoric significantly shapes public opinion, potentially even causing extremist behaviour. Buddhist symbolism and monastic endorsement also shape electoral support, which is both highly sought after by political leaders and detrimental for non-Buddhist politicians. The uneven power Buddhist figures hold in Sri Lankan politics suggests challenging and hostile social structures towards non-Sinhala-Buddhists. These institutions often propagate messages that are not representative of traditional Buddhist teachings, suggesting that the authority vested in Buddhist figures due to their Buddhist affiliation is misused in Sri Lanka. ",
                "link": "/post/2025/08/buddhism-in-sri-lanka.html",
                "button": "Read More"
        },
        "6": {
                "img": "/media/girl-children-in-lolita.jpg",
                "title": "Are Girl-Children Immoral and Dangerous Seductresses in Lolita?",
                "description": "In Nabokov’s Lolita, readers are presented with Humbert Humbert, who grooms and eventually rapes Dolores Haze, his “Lolita”. Despite his regret of the “foul lust [he] had inflicted upon [her],” and Dr. John Ray’s denouncement of Humbert as “horrible [and] abject,” in the preface, the social perception of Dolores and the “girl-children” is far from being absolved. Bertens (2001) argues that one of the “cultural stereotypes” imposed on female characters is, the “immoral and dangerous seductress,” which is true for Lolita and the “nymphets”, created by both Humbert and society, but not necessarily Dolores and the “girl-children”, created by Nabokov. ",
                "link": "/post/2025/08/girl-children-in-lolita.html",
                "button": "Read More"
        },
        "7": {
                "img": "/media/sopa-blog-img1.jpg",
                "title": "Physicists Can Be Poets Too",
                "description": "Physicists work on problems and cases that may directly involve the general public. However, often times, physicists and the public don’t seem to be able to work on the same level. Poetry is one of the most effective methods to bring everyone to the same table—not through lecture, but through dialogue.",
                "link": "https://blogs.ed.ac.uk/physics-astronomy/2026/01/23/physicists-can-be-poets-too/",
                "button": "Blogs.Ed <i style='font-size:small' class='fa'>&#xf08e;</i>"
        }
}